Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_DMA4.h
#define DMA4_NBYTES_MLOFFYES_MLOFF_MASK          (0x3FFFFC00U)
#define DMA4_NBYTES_MLOFFYES_MLOFF_SHIFT         (10U)
/*! MLOFF - Minor Loop Offset */
#define DMA4_NBYTES_MLOFFYES_MLOFF(x)            (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFYES_MLOFF_SHIFT)) & DMA4_NBYTES_MLOFFYES_MLOFF_MASK)

#define DMA4_NBYTES_MLOFFYES_DMLOE_MASK          (0x40000000U)
#define DMA4_NBYTES_MLOFFYES_DMLOE_SHIFT         (30U)
/*! DMLOE - Destination Minor Loop Offset Enable
 *  0b0..The minor loop offset is not applied to the DADDR
 *  0b1..The minor loop offset is applied to the DADDR
 */
#define DMA4_NBYTES_MLOFFYES_DMLOE(x)            (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFYES_DMLOE_SHIFT)) & DMA4_NBYTES_MLOFFYES_DMLOE_MASK)

#define DMA4_NBYTES_MLOFFYES_SMLOE_MASK          (0x80000000U)
#define DMA4_NBYTES_MLOFFYES_SMLOE_SHIFT         (31U)
/*! SMLOE - Source Minor Loop Offset Enable
 *  0b0..The minor loop offset is not applied to the SADDR
 *  0b1..The minor loop offset is applied to the SADDR
 */
#define DMA4_NBYTES_MLOFFYES_SMLOE(x)            (((uint32_t)(((uint32_t)(x)) << DMA4_NBYTES_MLOFFYES_SMLOE_SHIFT)) & DMA4_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/* The count of DMA4_NBYTES_MLOFFYES */
#define DMA4_NBYTES_MLOFFYES_COUNT               (64U)

/*! @name SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address Register */
/*! @{ */

#define DMA4_SLAST_SDA_SLAST_SDA_MASK            (0xFFFFFFFFU)
#define DMA4_SLAST_SDA_SLAST_SDA_SHIFT           (0U)
/*! SLAST_SDA - Last Source Address Adjustment / Store DADDR Address */
#define DMA4_SLAST_SDA_SLAST_SDA(x)              (((uint32_t)(((uint32_t)(x)) << DMA4_SLAST_SDA_SLAST_SDA_SHIFT)) & DMA4_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/* The count of DMA4_SLAST_SDA */
#define DMA4_SLAST_SDA_COUNT                     (64U)

/*! @name DADDR - TCD Destination Address Register */
/*! @{ */

#define DMA4_DADDR_DADDR_MASK                    (0xFFFFFFFFU)
#define DMA4_DADDR_DADDR_SHIFT                   (0U)
/*! DADDR - Destination Address */
#define DMA4_DADDR_DADDR(x)                      (((uint32_t)(((uint32_t)(x)) << DMA4_DADDR_DADDR_SHIFT)) & DMA4_DADDR_DADDR_MASK)
/*! @} */

/* The count of DMA4_DADDR */
#define DMA4_DADDR_COUNT                         (64U)

/*! @name DOFF - TCD Signed Destination Address Offset Register */
/*! @{ */

#define DMA4_DOFF_DOFF_MASK                      (0xFFFFU)
#define DMA4_DOFF_DOFF_SHIFT                     (0U)
/*! DOFF - Destination Address Signed Offset */
#define DMA4_DOFF_DOFF(x)                        (((uint16_t)(((uint16_t)(x)) << DMA4_DOFF_DOFF_SHIFT)) & DMA4_DOFF_DOFF_MASK)
/*! @} */

/* The count of DMA4_DOFF */
#define DMA4_DOFF_COUNT                          (64U)

/*! @name CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) Register */
/*! @{ */

#define DMA4_CITER_ELINKNO_CITER_MASK            (0x7FFFU)
#define DMA4_CITER_ELINKNO_CITER_SHIFT           (0U)
/*! CITER - Current Major Iteration Count */
#define DMA4_CITER_ELINKNO_CITER(x)              (((uint16_t)(((uint16_t)(x)) << DMA4_CITER_ELINKNO_CITER_SHIFT)) & DMA4_CITER_ELINKNO_CITER_MASK)

#define DMA4_CITER_ELINKNO_ELINK_MASK            (0x8000U)
#define DMA4_CITER_ELINKNO_ELINK_SHIFT           (15U)
/*! ELINK - Enable channel-to-channel linking on minor-loop complete
 *  0b0..The channel-to-channel linking is disabled
 *  0b1..The channel-to-channel linking is enabled
 */
#define DMA4_CITER_ELINKNO_ELINK(x)              (((uint16_t)(((uint16_t)(x)) << DMA4_CITER_ELINKNO_ELINK_SHIFT)) & DMA4_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/* The count of DMA4_CITER_ELINKNO */
#define DMA4_CITER_ELINKNO_COUNT                 (64U)

/*! @name CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) Register */
/*! @{ */

#define DMA4_CITER_ELINKYES_CITER_MASK           (0x1FFU)
#define DMA4_CITER_ELINKYES_CITER_SHIFT          (0U)
/*! CITER - Current Major Iteration Count */
#define DMA4_CITER_ELINKYES_CITER(x)             (((uint16_t)(((uint16_t)(x)) << DMA4_CITER_ELINKYES_CITER_SHIFT)) & DMA4_CITER_ELINKYES_CITER_MASK)

#define DMA4_CITER_ELINKYES_LINKCH_MASK          (0x7E00U)
#define DMA4_CITER_ELINKYES_LINKCH_SHIFT         (9U)
/*! LINKCH - Minor Loop Link Channel Number */
#define DMA4_CITER_ELINKYES_LINKCH(x)            (((uint16_t)(((uint16_t)(x)) << DMA4_CITER_ELINKYES_LINKCH_SHIFT)) & DMA4_CITER_ELINKYES_LINKCH_MASK)

#define DMA4_CITER_ELINKYES_ELINK_MASK           (0x8000U)
#define DMA4_CITER_ELINKYES_ELINK_SHIFT          (15U)
/*! ELINK - Enable channel-to-channel linking on minor-loop complete
 *  0b0..The channel-to-channel linking is disabled
 *  0b1..The channel-to-channel linking is enabled
 */
#define DMA4_CITER_ELINKYES_ELINK(x)             (((uint16_t)(((uint16_t)(x)) << DMA4_CITER_ELINKYES_ELINK_SHIFT)) & DMA4_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/* The count of DMA4_CITER_ELINKYES */
#define DMA4_CITER_ELINKYES_COUNT                (64U)

/*! @name DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address Register */
/*! @{ */

#define DMA4_DLAST_SGA_DLAST_SGA_MASK            (0xFFFFFFFFU)
#define DMA4_DLAST_SGA_DLAST_SGA_SHIFT           (0U)
/*! DLAST_SGA - Final Destination Address Adjustment / Scatter Gather Address */
#define DMA4_DLAST_SGA_DLAST_SGA(x)              (((uint32_t)(((uint32_t)(x)) << DMA4_DLAST_SGA_DLAST_SGA_SHIFT)) & DMA4_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/* The count of DMA4_DLAST_SGA */
#define DMA4_DLAST_SGA_COUNT                     (64U)

/*! @name CSR - TCD Control and Status Register */
/*! @{ */

#define DMA4_CSR_START_MASK                      (0x1U)
#define DMA4_CSR_START_SHIFT                     (0U)
/*! START - Channel Start
 *  0b0..The channel is not explicitly started.
 *  0b1..The channel is explicitly started via a software initiated service request.
 */
#define DMA4_CSR_START(x)                        (((uint16_t)(((uint16_t)(x)) << DMA4_CSR_START_SHIFT)) & DMA4_CSR_START_MASK)

#define DMA4_CSR_INTMAJOR_MASK                   (0x2U)
#define DMA4_CSR_INTMAJOR_SHIFT                  (1U)
/*! INTMAJOR - Enable an interrupt when major iteration count completes.
 *  0b0..The end-of-major loop interrupt is disabled.
 *  0b1..The end-of-major loop interrupt is enabled.
 */
#define DMA4_CSR_INTMAJOR(x)                     (((uint16_t)(((uint16_t)(x)) << DMA4_CSR_INTMAJOR_SHIFT)) & DMA4_CSR_INTMAJOR_MASK)

